import 'package:flutter/material.dart';






class Screen2 extends StatelessWidget {
  const Screen2({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return  Directionality(
      textDirection: TextDirection.rtl,
      child: Scaffold(
        appBar: AppBar(
          backgroundColor: Colors.deepPurpleAccent,
          title: Text("المشاكل و الحلول"),
        ),
        body: SafeArea(

          child:SingleChildScrollView(
            child: Container(
              width: double.infinity,
              // color: Colors.pink,

              child: Padding(
                padding: const EdgeInsets.only(top: 20.0,right: 10,left: 10),
                child: Column(
                  crossAxisAlignment: CrossAxisAlignment.start,

                  children: [
                    Text(
                      "أسباب الاحتباس الحراري"
                      , style: TextStyle(fontSize: 18,fontWeight: FontWeight.bold),


                    ),
                    SizedBox(height: 10,),
                    Text(
                      "العوامل البشرية تُساهم الأنشطة البشريّة في تغيير المناخ بشكلٍ واضحٍ من خلال استخدام الإنسان للوقود الأحفوري بأشكاله المختلفة في أنشطته، إذ إنّ احتراق الوقود الأحفوري يؤدي إلى انبعاث الغازات الدفيئة كغاز ثاني أكسيد الكربون في الجو، ممّا يؤدي إلى إحداث تغيير في الغلاف الجويّ مثل كميّة الهباء الجوي جزيئات عالقة في الهواء والغيوم.[٨] تؤثر كل من الغازات الدفيئة والهباء الجوي في اختلال توازن طاقة الأرض من خلال تأثيرها على التغيّر في نسبة الإشعاع الشمسي والأسعة تحت الحمراء الداخلة للغلاف الجوي والخارجة منه، واختلاف خصائص الغازات والجزيئات، ممّا يؤدي إلى ارتفاع درجة حرارة الأرض.[٨] وفيما يأتي بعض المصادر الرئيسية للغازات الدفيئة بسبب النشاط البشري:[٩] زيادة تركيز نسبة ثاني أكسيد الكربون معماري، مصدراً أساسيّاً في انبعاث غاز ثاني أكسيد الكربون بصورة كبيرة. ارتفاع تركيز الميثان في الجو بسبب العديد من العوامل ومنها ما يأتي: التخمُّر المعوي للدواب. طرق إدارة السماد. زراعة حقول الأرز. التغيّر في طرق استخدام الأراضي والتغيّر في رطوبة الأرض. تأثيرات خطوط الأنابيب. سوء التهوية في مكبّات النفايات. ارتفاع تركيز أكسيد النيتروس  أكسيد النيتروجين الثنائي  بسبب الأنشطة الزراعيّة المختلفة بما فيها استخدام الأسمدة. استخدام مركبات الكلورو فلورو كربون (CFCs) في العديد من المجالات، منها: أنظمة إخماد الحريق. عمليّات التصنيع. استخدامها بالإضافة مع الهالونات في أنظمة التبريد. العوامل الطبيعية تعتبر ظاهرة الاحتباس الحراري ظاهرة معقدة؛ فهي ناتجة عن التفاعل بين الأسباب البشريّة مع مجموعةٍ من العوامل الطبيعيّة، ويعد الارتفاع في متوسط درجة الحرارة في الوقت الحاضر ناتجاً عن التفاعل بينهما، ومن العوامل الطبيعية ما يأتي. البراكين تعتبر البراكين أحد العوامل التي تُساهم في تشكيل ظاهرة الاحتباس الحراري، حيث إنّ حدوث ثوران البراكين على مدى ملايين السنين أدّى إلى انبعاث كميّاتٍ كبيرةٍ من الغازات الدفيئة في الجو، كبخارالماء وثاني أكسيد الكربون.[١١] وجدير بالذكر أنّ الثوران البركانيّ الواحد ليس له تأثير على ظاهرة الاحتباس الحراري، لكن تلك التأثيرات ناتجة عن حدوث العديد من البراكين خلال تاريخ الأرض، فعند دراسة تأثير جميع تلك البراكين منذ تكوّن الأرض يتبيّن أثر البراكين في زيادة تركيز ثاني أكسيد الكربون في الجو، بالتالي تأثيره في ظاهرة الاحتباس الحراري.[١١] النشاط الشمسي تؤثر التغيُّرات الحاصلة في النشاط الشمسي والأنشطة المرتبطة به كالتوهجات والبقع الشمسيّة في تغير درجة الحرارة العالميّة، ومثال ذلك، تميّز القرن السابع عشر بفترةٍ مناخيّةٍ تسمى العصر الجليديّ الصغير، والذي تمّ تفسير تشكّله في ذلك الوقت بأنّ نشاط الشمس القليل، وأشعتها خافتة، إذ كانت متوسط درجة الحرارة العالميّة أقل بنحو درجة مئويةٍ واحدة مما هو عليه الآن.[١٠] ولاحظ العلماء وجود عدد من التغيّرات الشمسيّة والتي تؤثر في الاحتباس الحراري وهي كالآتي:  تغيير دوريٍ في النشاط الشمسي مثل التغيُّر في دورة البقع الشمسيّة والتي تمتد إلى   عاماً. تغيُّر النشاط المغناطيسي داخل الشمس والذي يؤثر على النشاط الشمسي، بسبب دوره الرئيسي في تشتيت الأشعة الكونيّة المكوّنة من جسيمات مشحونةٍ في الأرض، وقد ينهار المجال المغناطيسي عندما تصبح أشعة الشمس خافتة ممّا يعمل على اختراق الأشعة الكونيّة للنظام الشمسي بصورةٍ أعمق، عندها يتم دخول أعدادٍ أكبر من تلك الأشعة الكونيّة واختراق الغلاف الجوي للأرض. ثمّ تتأين الجسيمات المشحونة للأشعة الكونيّة على شكل جزيئاتٍ صغيرة من الندى والتي تبدأ في التجمُّع معاّ لتشكيل قطرات ماء والتي بدورها تعمل على تشكيل السحب، وفي حال تكوُّن سحب منخفضةٍ بسماكةٍ عاليةٍ فإنّها تعمل على عكس طاقة الشمس إلى الفضاء، لذا فإنّ تكرار تكوين غطاءٍ سحابيٍّ بتلك الطريقة سيؤدي مع مرور الوقت إلى تغيّر في متوسط درجة الحرارة العالميّة. التغيّرات في الأطوال الموجيّة كالأطوال الموجيّة المرئيّة والموجات فوق البنفسجية. ذوبان الجليد السرمدي يساهم ذوبان الجليد في كل من القطبين الشمالي والجنوبي وعلى نطاقٍ واسعٍ في ظاهرة الاحتباس الحراري بسبب وجود كميّاتٍ كبيرةٍ من الكربون المخزَّن في الجليد، وبعد ذوبان ذلك الجليد بفعل العديد من العوامل كحرائق الغابات والانفجارات البركانيّة والنشاط الشمسي يتم إطلاق الغازات بشكلٍ واسعٍ.  وعند انبعاث الكربون بشكلٍ مفاجئٍ سيؤدي إلى إحداث خلل في العمليات الطبيعيّة المختلفة مثل دورة الكربون، إذ إنّ مصدر الكربون المخزّن في الجليد يكون من خارج الغلاف الجوي منذ آلاف السنين.[١٠] حرائق الغابات تؤثر حرائق الغابات في متوسط درجة الحرارة العالميّة، خاصةً التي تحدث على نطاقٍ واسعٍ وعلى مدى فتراتٍ طويلةٍ، إذ إنّ احتراق النباتات يؤدي إلى انبعاث الكربون المخزَّن في النباتات، وبالتالي زيادة نسبة الغازات الدفيئة مثل غاز ثاني أكسيد الكربون في الجو، وهذه الغازات بالإضافة للإشعاع الشمسي لها دور كبير في ارتفاع درجة حرارة الغلاف الجوي وتلويث الهواء.  آثار الاحتباس الحراري آثار الاحتباس الحراري على الصحة تؤثر ظاهرة الاحتباس الحراري أو الدفيئة على صحة الكائنات الحية، ومثال ذلك كما يأتي:[١٢] تفشّي الالتهابات الضارّة ووباء الكوليرا الحاد في بعض أنواع المأكولات البحريّة؛ بسبب ارتفاع درجة حرارة المياه السطحيّة كالمحيطات. تدنّي قدرة الأجسام على مقاومة الفيروسات والالتهابات المعدية بسبب فشل المحاصيل الزراعيّة وانتشار المجاعات. انتشار مرض حصى الكلى الناتج عن الجفاف وقد بيّنت الدراسات ارتفاع معدلات الإصابة بهذا المرض منذ عام 1994م، بعد أن كان المعدّل إصابة شخص واحد من أصل 20 شخصاً أصبح الآن المعدّل هو شخص واحد من أصل 11 شخصاً، وفي حال استمرار ارتفاع درجة الحرارة للكرة الأرضيّة من المتوقع زيادة عدد الإصابات به. ارتفاع درجة حرارة الصيف وإطالة مدَّته يؤدّي إلى انتشار العديد من الأمراض التي يسببها البعوض، ومنها الإصابة بفيروس غرب النيل. آثار الاحتباس الحراري على المناخ يؤثر الاحتباس الحراري على المناخ بصورةٍ واضحة، ومن هذا التأثيرات ما يأتي:  تغيّر معدّلات هطول الأمطار يؤدي ارتفاع متوسط درجات الحرارة في العالم لزيادة معدلات التبخر، مما يُعجّل من حدوث دورة المياه، إذ إنّ البخار المتصاعد في الجو سيؤدي لهطول كميّات أكبر من الأمطار، علماً بأنها لن تتوزع بالتساوي على جميع مناطق العالم، كما أنّ بعض المناطق سيكون فصل الشتاء فيها أكثر رطوبة، وأكثر جفافاً في فصل الصيف، ووفقاً للدراسات فإن معدّل هطول الأمطار العالميّ سيزداد تقريبا من 3% إلى 5%. ذوبان الثلوج والجليد سيؤدي ارتفاع درجة حرارة المناخ إلى ذوبان أشكال الجليد على سطح الأرض كالأنهار أو الصفائح الجليديّة والثلوج في فصل الصيف، لذا يتوقع علماء الطقس بأنّ كمية الجليد البحري العائمة في المحيطين الشمالي والجنوبي ستنخفض خلال القرن الحادي والعشرين دون تحديد كمية الذوبان بدقّة. ارتفاع مستوى سطح البحر أدّى ارتفاع درجات الحرارة إلى ارتفاع مستوى البحر ومنسوبه، وذلك بسبب ذوبان الصفائح والأنهار الجليديّة والماء المُتجمد في المحيطات، بالإضافة لزيادة حجم المياه بالمسطحات المائيّة بسبب تمددها الناتج عن ارتفاع الحرارة، وما تجدّر الإشارة إليه أن مستوى سطح البحر ارتفع من (10- 20) سم خلال القرن العشرين، ومن المتوقع ارتفاع مستوى سطح البحر حوالي (20 - 50) سم بحلول عام 2100م. زيادة حموضة المحيطات تساعد المحيطات على سطح الأرض على تقليل التغييرات المناخيّة التي تحدث في العالم، من خلال امتصاصها لبعض الحرارة الزائدة وثاني أكسيد الكربون من الغلاف الجويّ، ولكن هناك العديد من التفاعلات التي تحدث بين الماء وثاني أكسيد الكربون التي ترفع من تحمض المحيطات أو زيادة حموضة المحيطات، بعد أنّ كان لهذه التفاعلات أثر بتقليها. لذا من المتوقع ارتفاع زيادة الحموضة من 0.14 إلى 0.35 درجة حموضة بحلول عام 2100، مما قد يسبب المزيد المشاكل للكائنات البحريّة. التأثير على التيّارات المحيطيّة تنتج التيّارات المحيطيّة بسبب الاختلاف في ملوحة المحيطات ودرجة حرارتها، فعندما ترتفع حرارة المحيطات بجانب تغير ملوحتها بفعل عدة عوامل منها؛ تغيّر معدلات هطول الأمطار، وزيادة تدفّق المياه العذبة الناتجة عن ذوبان الجليد إلى المحيطات، فإنّ ذلك يؤدي إلى تعطّل في حركة التيّارات أو تعطّل الدورة الحراريّة الملحيّة في المحيطات، ممّا يؤثر بشكلٍ كبيرٍ على المناخ. التغيُّر في الطقس يعتقد بعض علماء المناخ أن الأعاصير ومنها الأعاصير المداريّة ستتغير (وربما بدأت بالفعل) نتيجة الاحترار العالمي، إذ توفر مياه سطح المحيطات الطاقة اللازمة لإحداث العواصف، فمن المتوقع أن تتسبب المحيطات ذات المياه الدافئة بزيادة شدة الأعاصير وقوة تدميرها مع مرور الوقت. زيادة أعداد السحب تعد الغيوم واحدة من عناصر المناخ العالميّ، حيث يؤدي ارتفاع درجات الحرارة إلى زيادة معدّل التبخر بشكلٍ أكبر، ممّا يسبب إنتاج كميّاتٍ كبيرةٍ من بخار الماء في الجو، والذي يتكاثف على شكل قطرات لتتجمَّع، وتتكاثف، وتكوِّن السحب بأنواعها المختلفة، ولهذه السُحب تأثيرات مختلفة على المناخ، فبعضها تعمل على تبريد المناخ، وبعضها الآخر يُعزّز من تأثير الغازات الدفئية من خلال بخار الماء. تغيُّر دورة الكربون تشير نماذج دورة الكربون العالمية إلى أن نظام الأرض سيكون قادرًا على امتصاص كمية أقل من ثاني أكسيد الكربون من الغلاف الجوي مع ارتفاع درجة حرارة المناخ ، مما يؤدي إلى تفاقم مشكلة الاحتباس الحراري."
                       , style: TextStyle(fontSize: 18),


                    ),
                    SizedBox(height: 10,),
                    Text(
                      "حلول لمشكلة الاحتباس الحراري:"
                      , style: TextStyle(fontSize: 18,fontWeight: FontWeight.bold),


                    ),
                    SizedBox(height: 10,),


                    Text(
                      "يوجد العديد من الحلول التي يُمكن تنفيذها من أجل الحد من ظاهرة الاحتباس الحراري، ومنها:  تعزيز كفاءة استخدام الطاقة إذ أنّ أنظمة الطاقة المستخدمة في تدفئة وتبريد المباني لها الدور الأكبر في ظاهرة الاحتباس الحراري، وبالتالي فإنّ كفاءة استخدام الطاقة تتيح إمكانيّة استخدام كمية أقل والحصول على نفس الانتاج والخدمات ممّا يساعد في توفير الطاقة والمال. تحسين قطاع وسائل النقل يؤدي قطاع النقل إلى انبعاث غازاتٍ بصورة كبيرةٍ، وقد زادت هذه الانبعاثات بصورةٍ سريعةٍ خلال العقد الماضي، لذا ينبغي الحد من هذه الانبعاثات من خلال اتباع ما يأتي: تحسين الكفاءة لجميع وسائل النقل. الانتقال إلى الوقود منخفض الكربون. استخدام أنظمة النقل الجماعي الأكثر كفاءة. إنتاج جيل ذكي من السيارات يساعد على التقليل من انبعاث الغازات. التخلُّص بشكلٍ تدريجيٍّ من الكهرباء المُنتَجة من الوقود الأحفوري ويتم ذلك من خلال عددٍ من الإجراءات الأساسية وهي: توقيف مصانع الفحم ويتم البدء بالمصانع الأقدم والأكثر تلويثاً. منع إنشاء محطات توليد الطاقة التي تعتمد على حرق الفحم. تطبيق التكنولوجيا المتقدمة في التقاط انبعاثات الكربون من محطات الطاقة وتخزينها في الأرض. استخدام الطاقة النووية تساعد الطاقة النووية على الحد من الاحتباس الحراري بسبب إطلاقها لكميّاتٍ قليلةٍ من من الغازات المُنبعثة من عملية الاحتباس الحراري، لكنّها في المقابل لها أثار خطيرة على المجتمع، لذا من المهم اكتشاف الطاقة النوويّة بصورة أكبر والبحث عن حلول لمشاكلها. تطوير تكنولوجيا جديدة لاستخدام الوقود منخفض الكربون يُساعد تطوير ونشر الوعي إزاء الوقود منخفض الكربون على الحد من الانبعاثات الضارّة، ويُمكن استحداث مصادر جديدة للطاقة كالطحالب والبكتيريا، وتوجيه الأبحاث حول الاستفادة من تكنولوجيا المواد الجديدة للخلايا الشمسية والبطاريات. ضمان التنمية المستدامة تؤثر كل منطقة من مناطق العالم بشكلٍ مختلفٍ في مشكلة الاحتباس الحراري وفي قدرتها على مواجهتها، وعموماً ينبغي ان تتعاون جميع الدول في مواجهة المشكلة، ومساعدة الدول الفقيرة في التكيّف مع آثار التغيُّر المناخي، وتعزيز قدرتها على التحوُّل إلى استخدام الوقود المنخفض الكربون. إدارة الغابات والزراعة من المهم الحفاظ على الغابات وتجنُّب إزالتها و الحد من تدهورها، وإنتاج الغذاء بطرقٍ أكثر استدامة، وذلك للحد من الانبعاثات الناتجة عن إزالة الغابات وعن الزراعة. تحديث مصادر الطاقة المتجددة أثبتت العديد من الدراسات قدرة الطاقة المتجددة كالطاقة الشمسيّة والحيويّة وغيرها منأشكال الطاقة المتجددة على تلبية غالبيّة احتياجات العالم من الطاقة، إضافةً لميزاتها في التقليل من التلوُّث وكلفتها المناسبة، لذا من المهم الاعتماد عليها بشكلٍ أكبر. الحد من ثاني أكسيد الكربون ويكون ذلك بالحفاظ على دور النظم الحيويّة؛ كالغابات والمحيطات في القيام بعملها الطبيعي كبالوعاتٍ للكربون من خلال إنهاء عمليّة إزالة الغابات والتشجيع على الزراعة باستمرار، وتجنُّب تدمير الموائل داخل المحيطات.  هل هناك فائدة للاحتباس الحراري؟ نعم، توجد بعض الفوائد لظاهرة الاحتباس الحراري، منها؛ التقليل من موجات البرد القارصة التي تؤدي لوفاة الأشخاص، والحيوانات، ودمار المزروعات، كما أنّ الربيع يبدأ مبكرًا، وهذا ما يفيد أصحاب المزارع لتوفير الدفء للمزروعات. بالإضافة إلى ذلك يُتيح وجود الاحتباس الحراري الطريق في الممر الشمالي الغربي لوقت أكبر للتجارة البحرية، بسبب انصهار الجليد في القطب الشمالي. "
                      , style: TextStyle(fontSize: 18),


                    ),

                    ///////////
                    Text(
                      ""
                      , style: TextStyle(fontSize: 18),


                    ),
                    Text(
                      ""
                      , style: TextStyle(fontSize: 18),


                    ),
                    Text(
                      ""
                      , style: TextStyle(fontSize: 18),


                    ),
                    Text(
                      ""
                      , style: TextStyle(fontSize: 18),


                    ),
                    Text(
                      ""
                      , style: TextStyle(fontSize: 18),


                    ),
                    Text(
                      ""
                      , style: TextStyle(fontSize: 18),


                    ),
                  ],
                ),
              ),

            ),
          ) ,
        ),
      ),
    );
  }
}
