import 'package:flutter/material.dart';






class Screen1 extends StatelessWidget {
  const Screen1({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return  Directionality(
      textDirection: TextDirection.rtl,
      child: Scaffold(
        appBar: AppBar(
          backgroundColor: Colors.deepPurpleAccent,
          title: Text("المفهوم"),
        ),
        body: SafeArea(

          child:SingleChildScrollView(
            child: Container(
              width: double.infinity,
             // color: Colors.pink,

              child: Padding(
                padding: const EdgeInsets.only(top: 20.0,right: 10,left: 10),
                child: Column(
                  crossAxisAlignment: CrossAxisAlignment.start,

                  children: [
                    Text(
                        "مفهوم الاحتباس الحراري وكيف يحدث؟"
                           , style: TextStyle(fontSize: 18,fontWeight: FontWeight.bold),


                    ),
                    SizedBox(height: 10,),
                    Text(
                      "عرّف ظاهرة الاحتباس الحراري، أو ظاهرة الاحترار العالمي (بالإنجيزيّة: Global Warming) أو ظاهرة الدفيئة (بالإنجليزية: Greenhouse)، على أنّها ارتفاع في معدّل درجة حرارة الهواء الجوّي الموجود في الطبقة السفلى من سطح الأرض، وذلك خلال القرن أو القرنين الماضيين.  وتحدث هذه الظاهرة عند حبس أو احتباس حرارة الشمس في الغلاف الجوي للأرض بعد دخولها إليه، ممّا يرفع درجة حرارة الأرض ويجعلها أكثر دفئاً،  ويتم ذلك من خلال امتصاص غازات الغلاف الجوي كثاني أكسيد الكربون لطاقة الشمس وحبسها بالقرب من الأرض ممّا يساهم في ارتفاع حرارة الأرض.  بعد مقارنة مجموعة من البيانات المتعلّقة بمختلف الظواهر الجويّة كدرجة الحرارة، ومعدلات هطول الأمطار مع التغيّرات الحاصلة في المناخ كالتركيب الكيميائيّ للغلاف الجوي، والتيارات البحريّة، تبيّن أنّ تلك التغيُّرات المناخيّة تحصل كل فترة زمنيّة معينة منذ بداية العصر الجيولوجيّ بشكلٍ طبيعي، لكن خلال الثورة الصناعيّة زادت التغيّرات المناخيّة بفعل الأنشطة البشريّة.  فخلال القرن الماضي ارتفع متوسط درجة الحرارة السطحيّة العالميّة من (0.3 إلى 0.6) درجة مئوية، وهي تمثّل أكبر زيادة في درجة حرارة سطح الأرض خلال الألف عام الماضية، ومن المتوقع زيادة أكبر في درجات الحرارة خلال هذا القرن،  إذ أنّ متوسط درجة الحرارة العالميّة في الوقت الحالي تبلغ 15 درجة مئوية، ويتوقع علماء الطقس زيادتها من 2-4 درجة مئوية بحلول عام 2100.  إنَّ ارتفاع متوسط درجة الحرارة العالميّة لا يعني بالضرورة أنّ جميع مناطق العالم ستصبح أكثر دفئاً، فالاحتباس الحراري لا يدل على ارتفاع درجة الحرارة بنفس المقدار في كل مكان، لكنّه يدل على ارتفاعٍ عام في متوسط درجة الحرارة العالميّة.  وما تجدر الإشارة إليه انّ الاحتباس الحراري العالمي يقدّم وصفاً للزيادة في درجات الحرارة العالميّة فقط، بالرغم من وجود دراسات تبيّن أنّ أثر الاحتباس الحراري يتعدّى مجرد الارتفاع في درجات الحرارة، إذ إنّ له أثراً رئيسياً في حصول التغيّرات المناخيّة في جميع أنحاء العالم، وفي أنماط الطقس العالميّة ممّا يؤثر على عناصر الطقس كمعدلات هطول الأمطار."
                      , style: TextStyle(fontSize: 18),


                    ),
                    Text(
                      ""
                      , style: TextStyle(fontSize: 18),


                    ),
                    Text(
                      ""
                      , style: TextStyle(fontSize: 18),


                    ),
                    Text(
                      ""
                      , style: TextStyle(fontSize: 18),


                    ),
                    Text(
                      ""
                      , style: TextStyle(fontSize: 18),


                    ),
                    Text(
                      ""
                      , style: TextStyle(fontSize: 18),


                    ),
                    Text(
                      ""
                      , style: TextStyle(fontSize: 18),


                    ),
                    Text(
                      ""
                      , style: TextStyle(fontSize: 18),


                    ),
                  ],
                ),
              ),

            ),
          ) ,
        ),
      ),
    );
  }
}
